In [ ]:
#Improt the database
import pandas as pd
import sqlite3
df = pd.read_csv('data/SWA_Fn-UseC_-HR-Employee-Attrition.csv')
conn = sqlite3.connect('data/mydb.db')
df.to_sql('Employees', conn, if_exists='replace', index=False)

1470

Q1 Python/ Sqlite

In [ ]:
# count the length by python 
total_employees = len(df)
print(f"Total employees: {total_employees}")

Total employees: 1470

In [12]:
# count the length by SQL
s1= pd.read_sql_query("select count (*) FROM Employees;",conn)
s1

   count (*)
0       1470

In [ ]:
# count the employee by department (Python)
department_counts = df.groupby('Department').size()
print("Employee count by Department:")
print(department_counts)

Employee count by Department:
Department
Human Resources            63
Research & Development    961
Sales                     446
dtype: int64

In [14]:
# count the employee by department (SQL)
s2 = pd.read_sql_query("SELECT Department, COUNT(EmployeeNumber) AS " \
"employee_count FROM Employees GROUP BY Department;",conn)
s2

               Department  employee_count
0         Human Resources              63
1  Research & Development             961
2                   Sales             446

In [ ]:
# Average income (Python) 
avg_income = df.groupby('JobRole')['MonthlyIncome'].mean().reset_index()
print("Average monthly income by job role:")
avg_income['MonthlyIncome'] = avg_income['MonthlyIncome'].astype(int)
print(avg_income)

Average monthly income by job role:
                     JobRole  MonthlyIncome
0  Healthcare Representative           7528
1            Human Resources           4235
2      Laboratory Technician           3237
3                    Manager          17181
4     Manufacturing Director           7295
5          Research Director          16033
6         Research Scientist           3239
7            Sales Executive           6924
8       Sales Representative           2626

In [16]:
# Average income (SQL) 
s3 = pd.read_sql_query("SELECT JobRole, AVG(MonthlyIncome) AS average_monthly_income " \
"FROM employees GROUP BY JobRole;",conn)
s3

                     JobRole  average_monthly_income
0  Healthcare Representative             7528.763359
1            Human Resources             4235.750000
2      Laboratory Technician             3237.169884
3                    Manager            17181.676471
4     Manufacturing Director             7295.137931
5          Research Director            16033.550000
6         Research Scientist             3239.972603
7            Sales Executive             6924.279141
8       Sales Representative             2626.000000

In [17]:
#Top 5 Employee by performancerate (Python)
top_5_employees = df.sort_values(by='PerformanceRating', ascending=False).head(5)
print("Top 5 employees by performance rating:")
print(top_5_employees[['PerformanceRating']])

Top 5 employees by performance rating:
      PerformanceRating
1467                  4
1433                  4
1432                  4
26                    4
21                    4

In [18]:
#Top 5 Employee by performancerate (SQL)
s4 = pd.read_sql_query("SELECT EmployeeNumber,PerformanceRating, JobRole FROM Employees " \
"ORDER BY PerformanceRating DESC LIMIT 5;",conn)
s4

   EmployeeNumber  PerformanceRating                 JobRole
0               2                  4      Research Scientist
1              10                  4   Laboratory Technician
2              11                  4   Laboratory Technician
3              12                  4  Manufacturing Director
4              27                  4    Sales Representative

In [20]:
# The highest average Performance Department (Python)
grouped = df.groupby('Department')['PerformanceRating'].mean()
highest_dept = grouped.idxmax()
highest_value = grouped.max()
print(f"{highest_dept} has the highest average PerformanceRate: {highest_value:.2f}")

Research & Development has the highest average PerformanceRate: 3.16

In [21]:
# The highest average Performance Department (SQL)
s5 = pd.read_sql_query("SELECT Department, ROUND(AVG(PerformanceRating),2) AS avg_rating " \
"FROM Employees GROUP BY Department ORDER " \
"BY avg_rating DESC LIMIT 1;",conn)
s5

               Department  avg_rating
0  Research & Development        3.16

In [22]:
# Average Age by Department (Python) 
Age_AVG = df.groupby('Department')['Age'].mean().reset_index()
print("Average Age:")
Age_AVG['Age'] = Age_AVG['Age'].astype(int)
print(Age_AVG)

Average Age:
               Department  Age
0         Human Resources   37
1  Research & Development   37
2                   Sales   36

In [23]:
# Average Age by Department (SQL) 
s6 = pd.read_sql_query("SELECT Department, ROUND(AVG(JobInvolvement),2) AS AVG_Job_Involvement " \
"FROM Employees GROUP BY Department ORDER BY AVG_Job_Involvement;",conn)
s6

               Department  AVG_Job_Involvement
0                   Sales                 2.70
1  Research & Development                 2.74
2         Human Resources                 2.75

In [24]:
# Average Job Involvement by  Department (Python)
AVG_JobInvolvement = df.groupby('Department')['JobInvolvement'].mean().round(2)
print("Average Job Involvement:")
print(AVG_JobInvolvement)

Average Job Involvement:
Department
Human Resources           2.75
Research & Development    2.74
Sales                     2.70
Name: JobInvolvement, dtype: float64

In [25]:
# Average Job Involvement by  Department (SQL)
s7 = pd.read_sql_query("SELECT Department, ROUND(AVG(Age), 1) AS avg_age " \
"FROM Employees GROUP BY Department;",conn)
s7

               Department  avg_age
0         Human Resources     37.8
1  Research & Development     37.0
2                   Sales     36.5

In [26]:
#Education count by department (Python)
education_count = df.groupby('Department')['Education'].value_counts()
print("education level:")
print(education_count)

education level:
Department              Education
Human Resources         3             27
                        4             15
                        2             13
                        1              5
                        5              3
Research & Development  3            379
                        4            255
                        2            182
                        1            115
                        5             30
Sales                   3            166
                        4            128
                        2             87
                        1             50
                        5             15
Name: count, dtype: int64

In [27]:
#Education count by department (SQL)
s8 = pd.read_sql_query("SELECT Department, Education, COUNT(*) as count From Employees GROUP BY Department, Education;",conn)
s8

                Department  Education  count
0          Human Resources          1      5
1          Human Resources          2     13
2          Human Resources          3     27
3          Human Resources          4     15
4          Human Resources          5      3
5   Research & Development          1    115
6   Research & Development          2    182
7   Research & Development          3    379
8   Research & Development          4    255
9   Research & Development          5     30
10                   Sales          1     50
11                   Sales          2     87
12                   Sales          3    166
13                   Sales          4    128
14                   Sales          5     15

## Conclusion
The analysis reveals the size and structure of the workforce, highlights salary differences by job role, and identifies top performers for recognition. It also shows which department performs best and provides insights into employee age, engagement, and education to support HR decisions on training and development.